// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "ഒരാൾ ഉറങ്ങുമ്പോൾ പിശാച് അവന്റെ പിരടിക്ക് മൂന്ന് കെട്ടുകൾ കെട്ടുന്നു.അതിൽ രണ്ടാമത്തെ കെട്ട് അഴിയുന്നത് എപ്പോളാണ്?",
    answer: "സുബ്ഹ് നിസ്കരിക്കുമ്പോൾ",
    options: [
      "ഉറക്കത്തിൽ നിന്ന് ഉണർന്ന് ദിക്ർ ചൊല്ലുമ്പോൾ",
      "സുബ്ഹ് നിസ്കരിക്കുമ്പോൾ",
      "വുളൂ ചെയ്യുമ്പോൾ",
      "സുബ്ഹിന്റെ മുമ്പുള്ള രണ്ട് റകഅത് നിസ്കരിക്കുമ്പോൾ"
    ]
  },
    {
    numb: 2,
    question: "നീ പൂജിച്ച്‌ കൊണ്ടേയിരിക്കുന്ന  നിന്റെ  ആ ദൈവത്തിന്റെ നേരെ നോക്കൂ. തീര്‍ച്ചയായും നാം അതിനെ ചുട്ടെരിക്കുകയും, എന്നിട്ട്‌ നാം അത്‌ പൊടിച്ച്‌ കടലില്‍ വിതറിക്കളയുകയും ചെയ്യുന്നതാണ്‌! മൂസാ നബി ആരോടാണ് ഇത് പറഞ്ഞത് ?",
    answer: "സാമിരിയ്യ്‌",
    options: [
      "ഹാമാൻ",
      "സാമിരിയ്യ്‌",
      "ഫിർഔൻ",
      "തന്റെ ജനതയോട്"
    ]
  },
    {
    numb: 3,
    question: "ആരുടെ മകനിലേക്ക് ചേർത്ത്‌ കൊണ്ടാണ് ആഇശ ബീവിയെ 'ഉമ്മു അബ്ദില്ല' എന്ന് വിളിക്കപ്പെടുന്നത് ?",
    answer: "സുബൈർ (റ)",
    options: [
      "അബ്‌ദുല്ലാഹി ബിൻ സുബൈർ",
      "അബ്‌ദുല്ലാഹി ബിൻ അബീബക്കർ",
      " അസ്മാഅ് ബിൻത് ഉമൈസ്",
      "സുബൈർ റ"
    ]
  },
    {
    numb: 4,
    question: "ഹജ്ജും ഉംറയും നിർവ്വഹിxക്കാൻ ഇഹ്‌റാം ചെയ്യുന്നതിന് വേണ്ടി വിത്യസ്ത ഭാഗങ്ങളിൽ നിന്ന് വരുന്നവർക്ക് ഓരോ മീഖാത്തുകളുണ്ട്.അബിയാർ അലി എന്ന പേരു കൂടിയുള്ള മീഖാത്ത് ഏതാണ് ?",
    answer: "ദുൽഹുലൈഫ",
    options: [
      "ദുൽഹുലൈഫ",
      "ഖർനുൽ മനാസിൽ",
      "ദാത്തു ഇർഖ്",
      "മസ്ജിദ് ആയിഷ"
    ]
  },
    {
    numb: 5,
    question: "അലി (റ) വിന്റേയും  മുആവിയ ( റ) വിന്റേയും സൈന്യങ്ങൾ തമ്മിൽ ഏറ്റുമുട്ടിയ യുദമാണല്ലോ സ്വിഫ്ഫീന്‍ യുദ്ധം.നിലവിൽ ഏത് രാജ്യത്താണ് സ്വിഫ്ഫീന്‍ സ്ഥിതി ചെയ്യുന്നത്?",
    answer: "സിറിയ",
    options: [
      "സിറിയ",
      "എത്യോപ്യ",
      "യമൻ",
      "ഫിലസ്‌തീൻ"
    ]
  },
  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

  //   {
  //   numb: 6,
  //   question: "Your Question is Here",
  //   answer: "Correct answer of the question is here",
  //   options: [
  //     "Option 1",
  //     "option 2",
  //     "option 3",
  //     "option 4"
  //   ]
  // },
];